app/Controllers/Frontend/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
---
    public function postLogin(){
        helper(['form']);
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $target_url = $this->request->getPost('target_url');
        $userModel = new User();
        $session = session();


        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if(!$this->validate($rules)){
            $session->setFlashdata('error', $this->validator->listErrors());
            return redirect()->to(base_url('/'))->withInput();
        }

        $user = $userModel->where('email', $email)->first();