app/Models/Url.php

    public function countClicksByCurrentYear($code)
    {
        $startDate = Carbon::parse('2023-01-01')->startOfYear();
        return $startDate;
        $endDate = Carbon::now()->endOfYear();
        $sDate = '2023-01';
        $eDate = '2023-12';
        $year = [];
        $clickCounts = [];
        $currentDate = $startDate->copy();
        return $currentDate;
        $urls = $this->where('code', $code)->first();
        $urlclick = new UrlClick();
            while ($currentDate <= $endDate) {
                $clickCount = $urlclick->where("DATE_FORMAT(created_at, '%Y-%m-%d') BETWEEN '{$currentDate->startOfMonth()->format("Y")}' AND '{$currentDate->endOfMonth()->format("m")}'")->where('shorten_url_id',$urls['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `url_clicks`
WHERE `shorten_url_id` = '5'
AND DATE_FORMAT(created_at, '%Y-%m-%d') BETWEEN '2023-01-01'  AND   '2023-01-31'

    public function countClicksByMonthRange($startDate, $endDate)
    {
        $startDate = Carbon::parse($startDate)->startOfMonth();
        $endDate = Carbon::parse($endDate)->endOfMonth();
        $clickCounts = [];
        $currentDate = $startDate->copy();
        $urls = $this->where('user_id', session()->get('auth')['id'])->findAll();
        $urlclick = new UrlClick();
        foreach ($urls as $key => $url) {
            while ($currentDate <= $endDate) {
                $clickCount = $urlclick->where('created_at BETWEEN "' . $currentDate->year . '" AND "' . $currentDate->month)->where('shorten_url_id',$urls['id'])->count();
---
SELECT COUNT(*) AS `numrows`
FROM `url_clicks`
WHERE `shorten_url_id` = '4'
AND DATE_FORMAT(created_at, '%Y-%m-%d') BETWEEN '2023-07-01'  AND   '2023-07-16'